Revit 2025 API
SpatialFieldManager.RegisterResult Method
 Registers result and assigns it a unique result index
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public int RegisterResult(
	AnalysisResultSchema resultSchema
)
Public Function RegisterResult (
	resultSchema As AnalysisResultSchema
) As Integer
public:
int RegisterResult(
	AnalysisResultSchema^ resultSchema
)
member RegisterResult :
        resultSchema : AnalysisResultSchema -> int
Parameters
resultSchema AnalysisResultSchema
 Result schema to be registered
Return Value
Int32
 Unique index assigned to the result
Exceptions
Exception | Condition
ArgumentException |  name of resultSchema is not unique in view
ArgumentNullException |  A non-optional argument was null
Example
// register a new result schema only if one with the same name does not already exist
IList<int> registeredResults = new List<int>();
AnalysisResultSchema resultSchema = new AnalysisResultSchema("Reactions", "Reaction Forces at Column Base");
registeredResults = spatialFieldManager.GetRegisteredResults();
int resultIndex = 999;
foreach (int myInt in registeredResults)
{
   if (spatialFieldManager.GetResultSchema(myInt).Name == "Reactions")
   {
      resultIndex = myInt;
      break;
   }
}
if (resultIndex == 999) // there are existing registered results, but none are named "Reactions"
   resultIndex = spatialFieldManager.RegisterResult(resultSchema);
' register a new result schema only if one with the same name does not already exist
Dim registeredResults As IList(Of Integer) = New List(Of Integer)()
Dim resultSchema As New AnalysisResultSchema("Reactions", "Reaction Forces at Column Base")
registeredResults = spatialFieldManager.GetRegisteredResults()
Dim resultIndex As Integer = 999
For Each myInt As Integer In registeredResults
    If spatialFieldManager.GetResultSchema(myInt).Name = "Reactions" Then
        resultIndex = myInt
        Exit For
    End If
Next
If resultIndex = 999 Then
    ' there are existing registered results, but none are named "Reactions"
    resultIndex = spatialFieldManager.RegisterResult(resultSchema)
End If
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace